app/controllers/categories_controller.rb

  def update
    @category = Category.find(params[:id])
    @category.update(category_params)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "slug" = ? WHERE "categories"."id" = ?  [["slug", "categorie-m-k"], ["id", 1]]

  def create
    @category = Category.create(category_params)
---
INSERT INTO "categories" ("name", "slug") VALUES (?, ?)  [["name", "categories test"], ["slug", "categories-test"]]