app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])
    post_params = params.require(:post).permit(:name,:age,:sexe)
    @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "name" = ?, "age" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["name", "tsito"], ["age", 17], ["updated_at", "2020-03-03 22:55:10.938522"], ["id", 1]]

  def create
    post = Post.create(post_params)
---
INSERT INTO "posts" ("name", "age", "sexe", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "d"], ["age", 4], ["sexe", "femme"], ["created_at", "2020-03-03 20:20:04.624533"], ["updated_at", "2020-03-03 20:20:04.624533"]]